app/controllers/categories_controller.rb

SELECT "posts".* FROM "posts"
SELECT "categories".* FROM "categories"
---
  def index
    @posts = Post.all
    @categories = Category.all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts"
---
  def show
    @category = Category.find(params[:id])
    @posts = Post.all