app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT "categories".* FROM "categories"
---
  def index
    @posts = Post.all
    @categories = Category.all